IRP/src/Enums/NumberingPeriods/NumberingPeriods.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>NumberingPeriods</name>
 <enumValues>
  <name>NoPeriod</name>
 </enumValues>
 <enumValues>
  <name>Year</name>
 </enumValues>
 <enumValues>
  <name>Quarter</name>
 </enumValues>
 <enumValues>
  <name>Month</name>
 </enumValues>
 <enumValues>
  <name>Week</name>
 </enumValues>
</mdclass:Enum>

IRP/src/Catalogs/NumeratorBasicRules/NumeratorBasicRules.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>NumeratorBasicRules</name>
  <attributes>
    <name>UseCompanyPrefix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseBranchPrefix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseDocumentPrefix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>UseTransactionTypePrefix</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PrefixTemplate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>CompanyPrefixes</name>
    <attributes>
      <name>Company</name>
      <type>
        <types>CatalogRef.Companies</types>
      </type>
    </attributes>
    <attributes>
      <name>Prefix</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>BranchPrefixes</name>
    <attributes>
      <name>Branch</name>
      <type>
        <types>CatalogRef.BusinessUnits</types>
      </type>
    </attributes>
    <attributes>
      <name>Prefix</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>DocumentPrefixes</name>
    <attributes>
      <name>Document</name>
      <type>
        <types>CatalogRef.ConfigurationMetadata</types>
      </type>
    </attributes>
    <attributes>
      <name>TransactionType</name>
      <type>
        <types>EnumRef</types>
      </type>
    </attributes>
    <attributes>
      <name>Prefix</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/Catalogs/NumeratorGroups/NumeratorGroups.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>NumeratorGroups</name>
  <attributes>
    <name>BasicRule</name>
    <type>
      <types>CatalogRef.NumeratorBasicRules</types>
    </type>
  </attributes>
  <attributes>
    <name>BeginDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>EndDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ByDefault</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberingPeriod</name>
    <type>
      <types>EnumRef.NumberingPeriods</types>
    </type>
  </attributes>
  <attributes>
    <name>NumberTemplate</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>StartNumber</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>TotalLength</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>WithoutLeadingZeros</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Documents</name>
    <attributes>
      <name>Document</name>
      <type>
        <types>CatalogRef.ConfigurationMetadata</types>
      </type>
    </attributes>
    <attributes>
      <name>NumberName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Catalogs</name>
    <attributes>
      <name>Catalog</name>
      <type>
        <types>CatalogRef.ConfigurationMetadata</types>
      </type>
    </attributes>
    <attributes>
      <name>NumberName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>DateName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

IRP/src/CommonModules/DocumentNumberingClientServer/Module.bsl
// Get number prifix type.
// 
// Returns:
//  Structure - Get number prifix type:
// * CompanyPrefix - String - 
// * BranchPrefix - String - 
// * DocumentPrefix - String - 
Function GetNumberPrifixType() Export
	
	Result = New Structure;
	
	Result.Insert("CompanyPrefix", "[company]");
	Result.Insert("BranchPrefix", "[branch]");
	Result.Insert("DocumentPrefix", "[document]");
	Result.Insert("CatalogPrefix", "[catalog]");
	
	Return Result;
	
EndFunction

// Get number parts.
// 
// Returns:
//  Structure - Get number parts:
// * Number - String - 
// * Basic - String - 
// * Year2 - String - 
// * Year4 - String - 
// * Quarter - String - 
// * Month1 - String - 
// * Month2 - String - 
// * Week1 - String - 
// * Week2 - String - 
Function GetNumberParts() Export
	
	Result = New Structure;
	
	Result.Insert("Number", "[number]");
	Result.Insert("Basic", "[basic]");
	Result.Insert("Year2", "[year2]");
	Result.Insert("Year4", "[year4]");
	Result.Insert("Quarter", "[quarter]");
	Result.Insert("Month1", "[month1]");
	Result.Insert("Month2", "[month2]");
	Result.Insert("Week1", "[week1]");
	Result.Insert("Week2", "[week2]");
	
	Return Result;
	
EndFunction

// Get numerator description.
// 
// Returns:
//  Structure - Get numerator description:
// * BasicRule - Structure - :
// ** Ref - CatalogRef.NumeratorBasicRules - 
// ** UseCompanyPrefix - Boolean - 
// ** UseBranchPrefix - Boolean - 
// ** UseDocumentPrefix - Boolean - 
// ** UseCatalogPrefix - Boolean - 
// ** UseTransactionTypePrefix - Boolean - 
// ** PrefixTemplate - String - 
// ** CompanyPrefixes - Map - 
// ** BranchPrefixes - Map - 
// ** DocumentPrefixes - Map - 
// ** CatalogPrefixes - Map - 
// * NumeratorRules - CatalogRef.NumeratorGroups - 
// * NumberTemplate - String - 
// * BeginDate - Date - 
// * EndDate - Date - 
// * ByDefault - Boolean - 
// * NumberingPeriod - EnumRef.NumberingPeriods - 
// * StartNumber - Number - 
// * TotalLength - Number - 
// * WithoutLeadingZeros - Boolean - 
// * CatalogDates - Map - 
Function GetNumeratorDescription() Export
	
	Description = New Structure;
	
	BasicRule = New Structure;
	BasicRule.Insert("Ref", PredefinedValue("Catalog.NumeratorBasicRules.EmptyRef"));
	BasicRule.Insert("UseCompanyPrefix", False);
	BasicRule.Insert("UseBranchPrefix", False);
	BasicRule.Insert("UseDocumentPrefix", False);
	BasicRule.Insert("UseCatalogPrefix", False);
	BasicRule.Insert("UseTransactionTypePrefix", False);
	BasicRule.Insert("PrefixTemplate", "");
	BasicRule.Insert("CompanyPrefixes", New Map);
	BasicRule.Insert("BranchPrefixes", New Map);
	BasicRule.Insert("DocumentPrefixes", New Map);
	BasicRule.Insert("CatalogPrefixes", New Map);
	Description.Insert("BasicRule", BasicRule);
	
	Description.Insert("NumeratorRules", PredefinedValue("Catalog.NumeratorGroups.EmptyRef"));
	Description.Insert("NumberTemplate", "");
	
	Description.Insert("BeginDate", Date(1,1,1));
	Description.Insert("EndDate", Date(1,1,1));
	Description.Insert("ByDefault", False);
	
	Description.Insert("NumberingPeriod", PredefinedValue("Enum.NumberingPeriods.NoPeriod"));
	Description.Insert("StartNumber", 0);
	Description.Insert("TotalLength", 0);
	Description.Insert("WithoutLeadingZeros", False);

	Description.Insert("CatalogDates", New Map);
	
	Return Description;
	
EndFunction
